Repository: JesusGPro/NAS
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Hard Drive Status
es: Estado del Disco Duro

source: System Disk Status
es: Estado del Disco del Sistema

source: Running on
es: Corriendo en

source: This data reflects your current machine.
es: Esto refleja los datos de tu ordenador.

source: Detected Disk Partitions
es: Particiones de Disco Detectadas

source: Device / Mount Point
es: Dispositivo / Punto de Montaje

source: Used (GB)
es: Usado (GB)

source: Free (GB)
es: Libre (GB)

source: Usage
es: Uso

source: No disk partitions could be detected or read.
es: No se pudieron detectar o leer particiones de disco.

source: Drive Content
es: Contenido del Disco

source: File Explorer
es: Explorador de Archivos

source: Drives
es: Discos

source: Create Folder
es: Crear carpeta

source: Upload Folder
es: Subir carpeta

source: Paste Items Here
es: Pega los archivos o carpetas aquí.

source: Paste
es: Pega

source: Upload File
es: Subir Archivo

source: Start Upload
es: Comenzar subida

source: Select a file and click 'Start Upload' to save it to the current directory.
es: Selecciona un archivo y haz click en 'Comienza subida' para guardar en el directorio actual.

source: Permission denied: You do not have permission to upload files to this directory.
es: Permiso denegado: No tienes permiso para suber archivos a este directorio.

source: Selected
es: Seleccionado

source: Copy
es: Copiar

source: Cut
es: Cortar

source: Delete
es: Eliminar

source: Compress
es: Comprimir

source: items selected
es: Elementos selccionados

source: Type
es: Tipo

source: Name
es: Nombre

source: Size
es: Tamaño

source: Last Modified
es: Última modificación

source: Actions
es: Acciones

source: Parent Directory
es: Directorio Superior

source: Download
es: Descargar

source: Download File
es: Descargar archivo

source: Rename
es: Renombrar

source: Uncompress Here
es: Descomprimir aquí

source: This folder is empty.
es: Esta carpeta está vacía.

source: Create New Folder
es: Crear nueva carpeta

source: Folder Name
es: Carpeta

source: Cancel
es: Cancelar

source: Create
es: Crear

source: Rename Item
es: Renombrar item

source: New Name
es: Nuevo nombre

source: Confirm Deletion
es: Confirma borrar

source: Are you sure you want to delete
es: ¿Estás seguro que quieres borrar?

source: This action cannot be undone.
es: Esta acción no se pueder revertir.

source: Note: If this is a folder, all contents will be permanently removed.
es: Nota: si esto es una carpeta, todo el contenido será borrado permanentemente.

source: Delete Permanently
es: Borrar permanantemente

source: Confirm Bulk Deletion
es: Confirma el borrado de todos los elemento(s)

source: Are you sure you want to delete the **
es: Estas seguro que quieres borrar **

source: selected items?** This action cannot be undone.
es: ¿Elmentos seleccionados?** Esta acción no es reversible.

source: Note: Folders and their contents will be permanently removed.
es: Nota: Las carpetas y sus contenidos serán borrados permanantemente.

source: Drag and drop the entire folder here.
es: Arrastra toda la carpeta aquí.

source: Uploaded Folder
es: Subir carpeta

source: Close
es: Cerrar

source: Confirm Compression
es: Confirma compresión

source: Are you sure you want to compress the following
es: Estas seguro que quieres comprimir lo siguiente

source: A new .zip file will be created in the current directory.
es: Un nuevo archivo .zip será creado en el directorio actual.

source: Confirm Uncompression
es: Confirma descompresión

source: Are you sure you want to extract the contents of
es: Estas seguro que quieres extraer el contenido de

source: into the current directory?
es: ¿En el directorio actual?

source: Uncompress
es: Descomprimir

source: Drag and drop files/folders here
es: Arrastra y deja archivos/carpetas aquí

source: Complete
es: Completar

source: Folder
es: Carpeta

source: File
es: Archivo

source: Inside NAS
es: Dentro del NAS

source: 4x 1TB NAS Status
es: Estado del NAS 4x 1TB

source: Previous
es: Anterior

source: Next
es: Siguiente

source: Author
es: Autor

source: October 2025
es: Octubre 2025

source: Invalid folder name.
es: Nombre de carpeta incorrecto.

source: Operation denied: Path traversal detected.
es: Acción denegada: detectado camino transversal.

source: Permission denied: You cannot create a folder in this location.
es: Permiso denegado: no puedes crear una carpeta en esta localización.

source: A folder named '%(name)s' already exists.
es: Una carpeta llamada '%(name)s' ya existe.

source: Folder '%(name)s' created successfully at: '%(path)s'
es: La carpeta '%(name)s' ha sido creada con éxito en: '%(path)s'

source: Failed to create folder: '%(e)s'
es: Fallo al crear la carpeta: '%(e)s'

source: Permission denied: You cannot download this folder.
es: Permiso denegado

source: Invalid folder path or item does not exist.
es: Camino de carpeta incorrecta o elemento inexistente.

source: Failed to create or stream the download: '%(e)s'
es: Error para crear la descarga: '%(e)s'

source: Permission denied.
es: Permiso denegado.

source: Root
es: Raíz

source: Invalid path provided. Redirected to root.
es: Camino equivocado. Redireccion a la raíz.

source: Access outside of the designated root directory is forbidden.
es: Acceso fura del directorio designado

source: Access denied: You do not have permission to view this content.
es: Acceso denegado: No tienes permiso para ver este contenido.

source: File not found
es: Archivo no encontrado

source: Could not download file.
es: No se pudo descargar el archivo.

source: Permission denied to access this directory.
es: Permiso denegado para acceder a este directorio.

source: Error listing directory content: '%(e)s'
es: Error al mostar el contenido del directorio: '%(e)s'

source: Path not found
es: Camino no encontrado

source: Permission denied: You cannot modify content in this location.
es: Permiso denegado: No puedes modificar el contenido en esta localización.

source: Invalid upload path: Attempted to upload outside the drive boundary.
es: Camino se subida incorrecto: Intento de subida fuera del entorno del disco.

source: File '%(file_name)s' uploaded successfully.
es: Archivo '%(file_name)s' subido con éxito.

source: Failed to save file: '%(e)s'
es: Error al salvar el archivo: '%(e)s'

source: Upload failed: Target directory is invalid or file is missing.
es: Fallo la subida: El destino del archivo es erroneo o falta el archivo.

source: New name cannot be empty.
es: El nuevo nombre no puede estar vacío.

source: New name contains illegal characters (e.g., '..' or starts with '.').
es: El nombre nuevo contiene charácteres ilegales (por ejemplo .. or comienza por . ).

source: Target path is outside the allowed drive boundary.
es: El camino está fuera del entorno permitido del disco.

source: An item named '%(new_name)s' already exists in this location.
es: Un elemento llamado '%(new_name)s' ya existe en esta localización.

source: Item successfully renamed from '%(old_name)s' to '%(new_name)s'.
es: El elemento ha sido renombrado con éxito de '%(old_name)s' a '%(new_name)s'.

source: Failed to rename item: '%(e)s'
es: Falló el renombare el elemento: '%(e)s'

source: Deletion of the root directory or outside boundary is not allowed.
es: La eliminación del directorio raíz o fuera del entorno no está permitido.

source: File '%(item_name)s' deleted successfully.
es: Archivo '%(item_name)s' borrado con éxito.

source: Folder '%(item_name)s' and its contents deleted successfully.
es: La carpeta '%(item_name)s' y su contenido borrado con éxito.

source: Item at '%(path)s' does not exist or is not a file/directory.
es: El elemento en '%(path)s' no existe o no es un archivo o directorio.

source: Permission denied: Could not delete '%(item_name)s'.
es: Permiso denegado: No se pudo borrar '%(item_name)s'.

source: Failed to delete item: '%(e)s'
es: Fallo el borrado del elemento: '%(e)s'

source: No items were selected for deletion.
es: No se eligión ningún elemento para su borrado.

source: Successfully deleted '%(count)s' item(s).
es: Borrado con éxito el item: '%(count)s'.

source: Failed to delete the following items: '%(names)s'
es: Falló el borrado del siguiente elemento(s): '%(names)s'

source: No items were selected for copying.
es: No se eligión ningún elemento para ser copiado.

source: Ready to copy '%(count)s' item(s). Navigate to the target folder and click Paste.
es: Preparado para copiar '%(count)s' elemento(s). Navega al sitio de la carpeta y haz click en pegar.

source: No items were selected for cutting.
es: No se eligión ningún elemento para ser cortado.

source: Ready to move '%(count)s' item(s). Navigate to the target folder and click Paste.
es: Preparado para mover '%(count)s' elemento(s). Navega al sitio de la carpeta y haz click en pegar.

source: No items were selected for paste operation or session expired.
es: No seleccionón ningún elemento para pegar o la sesión expiró.

source: Permission denied: You cannot modify content in the target location.
es: Permiso denegado: No puedes modificar el contenido en esta localización.

source: Skipped: Cannot move/copy '%(name)s' into itself or its sub-directory.
es: No se puede mover/copiar '%(name)s' en sí mismo o en un subdirectorio.

source: Skipped: Item named '%(name)s' already exists in the target location.
es: El elemento '%(name)s' ya existe en esta localización.

source: copied
es: copiado

source: moved
es: movido

source: Successfully '%(operation)s' '%(count)s' item(s) to the new location.
es: Exito en '%(operation)s' '%(count)s' elemento(s) en la nueva localización.

source: '%(success_count)s' item(s) successfully '%(operation)s', but '%(fail_count)s' item(s) failed.
es: '%(success_count)s' elemento(s) con exito en '%(operation)s', pero '%(fail_count)s' elemento(s) fallaron.

source: The operation failed for all selected items.
es: Fallo para todos los elementos seleccionados.

source: No valid files or folders were selected for compression.
es: No se han encontrado archivos o carpetas válidad que comprimir.

source: Internal Error: Permission check not available.
es: Error interno: Comprobación de permisos no disponible.

source: Successfully compressed %(count)s item(s) into '%(filename)s'.
es: Borrado con éxito los item(s)'%(count)s' en '%(filename)s'.

source: No valid files or folders were found to compress.
es: No se han encontrado archivos o carpetas válidad que comprimir.

source: Compression failed: '%(e)s'
es: La compresión falló: '%(e)s'

source: The specified file is not a valid ZIP archive or does not exist.
es: El archivo especificado no es un ZIP válido o no existe.

source: Successfully extracted '%(count)s' files/folders from '%(filename)s' into the folder: '%(folder_name)s'.
es: Extraido(s) '%(count)s' archivos/carpetas de '%(filename)s' en la carpeta: '%(folder_name)s' con éxito.

source: The ZIP file was successfully read but contained no files.
es: The archivo ZIP fue leído con éxito pero no contiene archivos.

source: Extraction failed due to **insufficient file system permissions**. The server cannot write to this location.
es: La extración fallo debido a **insuficientes permisos de archivo**. El servidor no puede escribir en esta localización.

source: Extraction failed: The ZIP file is corrupted or not a valid archive.
es: La extración fallo: el archivo ZIP está corrupto o no es un archivo válido.

source: An unknown error occurred during extraction: %s
es: Un error desconocido ocurrión durante la extracción: %s

source: English
es: Inglés

source: Spanish
es: Español

source: NAS Manager
es: Gestor de NAS

source: My NAS
es: Mi NAS

source: DisK Status
es: Estado del Disco

source: Logout
es: Cerrar sesión

source: Login
es: Iniciar sesión

source: 2025 Designed by Jesus Maria Garcia Pro. All rights reserved.
es: 2025 Desarrollado por Jesus Maria Garcia Pro. Todos los derechos reservados.
